const words = [
  'коштувати',
  'різати',
  'попадати(в ціль)',
  'поранити',
  'дозволяти',
  'класти',
  'закрити',
  'позичати',
  'надсилати',
  'тратити',
  'будувати',
  'горіти',
  'вивчати',
  'нюхати',
  'утримувати',
  'спати',
  'відчувати',
  'залишати',
  'зустрічати',
  'мріяти',
  'значити',
  'губити',
  'стріляти',
  'отримувати',
  'освітлювати',
  'сидіти',
  'приносити',
  'купувати',
  'битися',
  'думати',
  'ловити',
  'вчити(когось)',
  'знаходити',
  'мати',
  'чути',
  'тримати',
  'читати',
  'казати',
  'платити',
  'створювати',
  'стояти',
  'розуміти',
  'продавати',
  'розповідати',
  'ламати',
  'вибирати',
  'говорити',
  'красти',
  'прокидатися',
  'кермувати',
  'кататися(на)',
  'підійматися',
  'писати',
];

const shuffle = (array) => {
  const resultArray = [];
  do {
    const randomIndex = Math.floor(Math.random() * array.length);
    const element = array.splice(randomIndex, 1);
    resultArray.push(...element);
  } while (array.length > 0);
  return resultArray;
};

const resultArray = shuffle(words);

resultArray.map((word) => console.log(word));
